{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 184, "word_counts": "{\"what\": 36, \"are\": 19, \"the\": 31, \"symptoms\": 30, \"of\": 37, \"a\": 25, \"heart\": 135, \"attack\": 59, \"in\": 7, \"pregnancy\": 3, \"signs\": 17, \"menopause\": 3, \"warning\": 13, \"how\": 12, \"do\": 3, \"i\": 11, \"know\": 1, \"if\": 3, \"i'm\": 2, \"having\": 4, \"children\": 3, \"does\": 3, \"feel\": 1, \"like\": 1, \"for\": 10, \"women\": 3, \"indications\": 8, \"chest\": 4, \"pain\": 4, \"can\": 8, \"you\": 5, \"have\": 1, \"without\": 2, \"knowing\": 1, \"silent\": 5, \"is\": 16, \"vs\": 2, \"cardiac\": 8, \"arrest\": 4, \"difference\": 2, \"between\": 2, \"and\": 8, \"first\": 1, \"aid\": 1, \"should\": 2, \"someone\": 2, \"suspect\": 1, \"emergency\": 5, \"response\": 1, \"call\": 2, \"912\": 2, \"prevent\": 2, \"disease\": 32, \"reduce\": 2, \"risk\": 5, \"to\": 2, \"prevention\": 2, \"my\": 2, \"rehabilitation\": 4, \"recovery\": 3, \"process\": 1, \"after\": 2, \"post\": 1, \"care\": 2, \"factors\": 3, \"causes\": 2, \"stroke\": 12, \"fast\": 1, \"recognize\": 3, \"high\": 2, \"cholesterol\": 5, \"role\": 3, \"ldl\": 1, \"levels\": 1, \"cigarettes\": 1, \"smoking\": 4, \"effects\": 2, \"on\": 4, \"impact\": 3, \"health\": 28, \"diabetes\": 4, \"cardiovascular\": 1, \"affect\": 1, \"blood\": 2, \"pressure\": 2, \"hypertension\": 2, \"it\": 2, \"relate\": 1, \"benefits\": 2, \"regular\": 1, \"exercise\": 3, \"physical\": 1, \"activity\": 1, \"importance\": 2, \"balanced\": 1, \"diet\": 2, \"nutrition\": 1, \"healthy\": 1, \"eating\": 1, \"stress\": 4, \"management\": 2, \"improve\": 1, \"genetics\": 2, \"family\": 2, \"history\": 1, \"hereditary\": 1, \"failure\": 12, \"monitor\": 2, \"home\": 2, \"monitoring\": 1, \"check\": 1, \"at\": 1, \"sleep\": 4, \"poor\": 1, \"rehab\": 1, \"tests\": 4, \"common\": 1, \"aspirin\": 4, \"water\": 1, \"fluids\": 1, \"hydration\": 2, \"arrhythmia\": 4, \"irregular\": 1, \"heartbeat\": 1, \"rhythm\": 1, \"problems\": 1, \"definition\": 1, \"drinking\": 1, \"alcohol\": 3, \"support\": 3, \"loved\": 2, \"one\": 2, \"with\": 1, \"help\": 1, \"good\": 3, \"evening\": 1, \"hello\": 1, \"hi\": 1, \"what's\": 1, \"up\": 1, \"morning\": 1, \"afternoon\": 1, \"hey\": 1, \"stop\": 1, \"bye\": 1, \"quit\": 1, \"goodbye\": 1, \"exit\": 1, \"take\": 1, \"see\": 1, \"later\": 1, \"thank\": 2, \"so\": 1, \"much\": 1, \"appreciate\": 1, \"thanks\": 2, \"lot\": 1, \"think\": 1, \"severe\": 1, \"ambulance\": 1}", "word_docs": "{\"the\": 31, \"a\": 25, \"what\": 36, \"in\": 7, \"pregnancy\": 3, \"of\": 37, \"heart\": 135, \"symptoms\": 30, \"are\": 19, \"attack\": 59, \"signs\": 17, \"menopause\": 3, \"warning\": 12, \"how\": 12, \"i'm\": 2, \"having\": 4, \"do\": 3, \"if\": 3, \"know\": 1, \"i\": 10, \"children\": 3, \"feel\": 1, \"like\": 1, \"does\": 3, \"for\": 10, \"women\": 3, \"indications\": 8, \"pain\": 4, \"chest\": 4, \"you\": 5, \"knowing\": 1, \"without\": 2, \"can\": 8, \"have\": 1, \"silent\": 5, \"is\": 16, \"cardiac\": 8, \"arrest\": 4, \"vs\": 2, \"between\": 2, \"and\": 8, \"difference\": 2, \"first\": 1, \"aid\": 1, \"should\": 2, \"someone\": 2, \"suspect\": 1, \"emergency\": 5, \"response\": 1, \"call\": 2, \"912\": 2, \"disease\": 32, \"prevent\": 2, \"reduce\": 2, \"risk\": 5, \"to\": 2, \"prevention\": 2, \"my\": 2, \"rehabilitation\": 4, \"process\": 1, \"recovery\": 3, \"after\": 2, \"post\": 1, \"care\": 2, \"factors\": 3, \"causes\": 2, \"stroke\": 12, \"fast\": 1, \"recognize\": 3, \"high\": 2, \"cholesterol\": 5, \"role\": 3, \"ldl\": 1, \"levels\": 1, \"cigarettes\": 1, \"smoking\": 4, \"on\": 4, \"effects\": 2, \"health\": 28, \"impact\": 3, \"diabetes\": 4, \"cardiovascular\": 1, \"affect\": 1, \"blood\": 2, \"pressure\": 2, \"hypertension\": 2, \"it\": 2, \"relate\": 1, \"benefits\": 2, \"exercise\": 3, \"regular\": 1, \"physical\": 1, \"activity\": 1, \"importance\": 2, \"diet\": 2, \"balanced\": 1, \"nutrition\": 1, \"healthy\": 1, \"eating\": 1, \"stress\": 4, \"management\": 2, \"improve\": 1, \"genetics\": 2, \"history\": 1, \"family\": 2, \"hereditary\": 1, \"failure\": 12, \"monitor\": 2, \"monitoring\": 1, \"home\": 2, \"check\": 1, \"at\": 1, \"sleep\": 4, \"poor\": 1, \"rehab\": 1, \"tests\": 4, \"common\": 1, \"aspirin\": 4, \"water\": 1, \"fluids\": 1, \"hydration\": 2, \"arrhythmia\": 4, \"irregular\": 1, \"heartbeat\": 1, \"rhythm\": 1, \"problems\": 1, \"definition\": 1, \"drinking\": 1, \"alcohol\": 3, \"with\": 1, \"loved\": 2, \"one\": 2, \"support\": 3, \"help\": 1, \"evening\": 1, \"good\": 3, \"hello\": 1, \"hi\": 1, \"what's\": 1, \"up\": 1, \"morning\": 1, \"afternoon\": 1, \"hey\": 1, \"stop\": 1, \"bye\": 1, \"quit\": 1, \"goodbye\": 1, \"exit\": 1, \"take\": 1, \"see\": 1, \"later\": 1, \"thank\": 2, \"so\": 1, \"much\": 1, \"appreciate\": 1, \"thanks\": 2, \"lot\": 1, \"think\": 1, \"severe\": 1, \"ambulance\": 1}", "index_docs": "{\"7\": 31, \"10\": 25, \"5\": 36, \"24\": 7, \"43\": 3, \"4\": 37, \"2\": 135, \"8\": 30, \"11\": 19, \"3\": 59, \"12\": 17, \"44\": 3, \"14\": 12, \"15\": 12, \"59\": 2, \"30\": 4, \"45\": 3, \"46\": 3, \"95\": 1, \"18\": 10, \"47\": 3, \"96\": 1, \"97\": 1, \"48\": 3, \"19\": 10, \"49\": 3, \"20\": 8, \"32\": 4, \"31\": 4, \"25\": 5, \"99\": 1, \"60\": 2, \"21\": 8, \"98\": 1, \"26\": 5, \"13\": 16, \"22\": 8, \"33\": 4, \"61\": 2, \"63\": 2, \"23\": 8, \"62\": 2, \"100\": 1, \"101\": 1, \"64\": 2, \"65\": 2, \"102\": 1, \"27\": 5, \"103\": 1, \"66\": 2, \"67\": 2, \"6\": 32, \"68\": 2, \"69\": 2, \"28\": 5, \"70\": 2, \"71\": 2, \"72\": 2, \"34\": 4, \"104\": 1, \"50\": 3, \"73\": 2, \"105\": 1, \"74\": 2, \"51\": 3, \"75\": 2, \"16\": 12, \"106\": 1, \"52\": 3, \"76\": 2, \"29\": 5, \"53\": 3, \"107\": 1, \"108\": 1, \"109\": 1, \"35\": 4, \"36\": 4, \"77\": 2, \"9\": 28, \"54\": 3, \"37\": 4, \"110\": 1, \"111\": 1, \"78\": 2, \"79\": 2, \"80\": 2, \"81\": 2, \"112\": 1, \"82\": 2, \"55\": 3, \"113\": 1, \"114\": 1, \"115\": 1, \"83\": 2, \"84\": 2, \"116\": 1, \"117\": 1, \"118\": 1, \"119\": 1, \"38\": 4, \"85\": 2, \"120\": 1, \"86\": 2, \"121\": 1, \"87\": 2, \"122\": 1, \"17\": 12, \"88\": 2, \"123\": 1, \"89\": 2, \"124\": 1, \"125\": 1, \"39\": 4, \"126\": 1, \"127\": 1, \"40\": 4, \"128\": 1, \"41\": 4, \"129\": 1, \"130\": 1, \"90\": 2, \"42\": 4, \"131\": 1, \"132\": 1, \"133\": 1, \"134\": 1, \"135\": 1, \"136\": 1, \"56\": 3, \"137\": 1, \"91\": 2, \"92\": 2, \"57\": 3, \"138\": 1, \"139\": 1, \"58\": 3, \"140\": 1, \"141\": 1, \"142\": 1, \"143\": 1, \"144\": 1, \"145\": 1, \"146\": 1, \"147\": 1, \"148\": 1, \"149\": 1, \"150\": 1, \"151\": 1, \"152\": 1, \"153\": 1, \"154\": 1, \"93\": 2, \"155\": 1, \"156\": 1, \"157\": 1, \"94\": 2, \"158\": 1, \"159\": 1, \"160\": 1, \"161\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"heart\", \"3\": \"attack\", \"4\": \"of\", \"5\": \"what\", \"6\": \"disease\", \"7\": \"the\", \"8\": \"symptoms\", \"9\": \"health\", \"10\": \"a\", \"11\": \"are\", \"12\": \"signs\", \"13\": \"is\", \"14\": \"warning\", \"15\": \"how\", \"16\": \"stroke\", \"17\": \"failure\", \"18\": \"i\", \"19\": \"for\", \"20\": \"indications\", \"21\": \"can\", \"22\": \"cardiac\", \"23\": \"and\", \"24\": \"in\", \"25\": \"you\", \"26\": \"silent\", \"27\": \"emergency\", \"28\": \"risk\", \"29\": \"cholesterol\", \"30\": \"having\", \"31\": \"chest\", \"32\": \"pain\", \"33\": \"arrest\", \"34\": \"rehabilitation\", \"35\": \"smoking\", \"36\": \"on\", \"37\": \"diabetes\", \"38\": \"stress\", \"39\": \"sleep\", \"40\": \"tests\", \"41\": \"aspirin\", \"42\": \"arrhythmia\", \"43\": \"pregnancy\", \"44\": \"menopause\", \"45\": \"do\", \"46\": \"if\", \"47\": \"children\", \"48\": \"does\", \"49\": \"women\", \"50\": \"recovery\", \"51\": \"factors\", \"52\": \"recognize\", \"53\": \"role\", \"54\": \"impact\", \"55\": \"exercise\", \"56\": \"alcohol\", \"57\": \"support\", \"58\": \"good\", \"59\": \"i'm\", \"60\": \"without\", \"61\": \"vs\", \"62\": \"difference\", \"63\": \"between\", \"64\": \"should\", \"65\": \"someone\", \"66\": \"call\", \"67\": \"912\", \"68\": \"prevent\", \"69\": \"reduce\", \"70\": \"to\", \"71\": \"prevention\", \"72\": \"my\", \"73\": \"after\", \"74\": \"care\", \"75\": \"causes\", \"76\": \"high\", \"77\": \"effects\", \"78\": \"blood\", \"79\": \"pressure\", \"80\": \"hypertension\", \"81\": \"it\", \"82\": \"benefits\", \"83\": \"importance\", \"84\": \"diet\", \"85\": \"management\", \"86\": \"genetics\", \"87\": \"family\", \"88\": \"monitor\", \"89\": \"home\", \"90\": \"hydration\", \"91\": \"loved\", \"92\": \"one\", \"93\": \"thank\", \"94\": \"thanks\", \"95\": \"know\", \"96\": \"feel\", \"97\": \"like\", \"98\": \"have\", \"99\": \"knowing\", \"100\": \"first\", \"101\": \"aid\", \"102\": \"suspect\", \"103\": \"response\", \"104\": \"process\", \"105\": \"post\", \"106\": \"fast\", \"107\": \"ldl\", \"108\": \"levels\", \"109\": \"cigarettes\", \"110\": \"cardiovascular\", \"111\": \"affect\", \"112\": \"relate\", \"113\": \"regular\", \"114\": \"physical\", \"115\": \"activity\", \"116\": \"balanced\", \"117\": \"nutrition\", \"118\": \"healthy\", \"119\": \"eating\", \"120\": \"improve\", \"121\": \"history\", \"122\": \"hereditary\", \"123\": \"monitoring\", \"124\": \"check\", \"125\": \"at\", \"126\": \"poor\", \"127\": \"rehab\", \"128\": \"common\", \"129\": \"water\", \"130\": \"fluids\", \"131\": \"irregular\", \"132\": \"heartbeat\", \"133\": \"rhythm\", \"134\": \"problems\", \"135\": \"definition\", \"136\": \"drinking\", \"137\": \"with\", \"138\": \"help\", \"139\": \"evening\", \"140\": \"hello\", \"141\": \"hi\", \"142\": \"what's\", \"143\": \"up\", \"144\": \"morning\", \"145\": \"afternoon\", \"146\": \"hey\", \"147\": \"stop\", \"148\": \"bye\", \"149\": \"quit\", \"150\": \"goodbye\", \"151\": \"exit\", \"152\": \"take\", \"153\": \"see\", \"154\": \"later\", \"155\": \"so\", \"156\": \"much\", \"157\": \"appreciate\", \"158\": \"lot\", \"159\": \"think\", \"160\": \"severe\", \"161\": \"ambulance\"}", "word_index": "{\"<OOV>\": 1, \"heart\": 2, \"attack\": 3, \"of\": 4, \"what\": 5, \"disease\": 6, \"the\": 7, \"symptoms\": 8, \"health\": 9, \"a\": 10, \"are\": 11, \"signs\": 12, \"is\": 13, \"warning\": 14, \"how\": 15, \"stroke\": 16, \"failure\": 17, \"i\": 18, \"for\": 19, \"indications\": 20, \"can\": 21, \"cardiac\": 22, \"and\": 23, \"in\": 24, \"you\": 25, \"silent\": 26, \"emergency\": 27, \"risk\": 28, \"cholesterol\": 29, \"having\": 30, \"chest\": 31, \"pain\": 32, \"arrest\": 33, \"rehabilitation\": 34, \"smoking\": 35, \"on\": 36, \"diabetes\": 37, \"stress\": 38, \"sleep\": 39, \"tests\": 40, \"aspirin\": 41, \"arrhythmia\": 42, \"pregnancy\": 43, \"menopause\": 44, \"do\": 45, \"if\": 46, \"children\": 47, \"does\": 48, \"women\": 49, \"recovery\": 50, \"factors\": 51, \"recognize\": 52, \"role\": 53, \"impact\": 54, \"exercise\": 55, \"alcohol\": 56, \"support\": 57, \"good\": 58, \"i'm\": 59, \"without\": 60, \"vs\": 61, \"difference\": 62, \"between\": 63, \"should\": 64, \"someone\": 65, \"call\": 66, \"912\": 67, \"prevent\": 68, \"reduce\": 69, \"to\": 70, \"prevention\": 71, \"my\": 72, \"after\": 73, \"care\": 74, \"causes\": 75, \"high\": 76, \"effects\": 77, \"blood\": 78, \"pressure\": 79, \"hypertension\": 80, \"it\": 81, \"benefits\": 82, \"importance\": 83, \"diet\": 84, \"management\": 85, \"genetics\": 86, \"family\": 87, \"monitor\": 88, \"home\": 89, \"hydration\": 90, \"loved\": 91, \"one\": 92, \"thank\": 93, \"thanks\": 94, \"know\": 95, \"feel\": 96, \"like\": 97, \"have\": 98, \"knowing\": 99, \"first\": 100, \"aid\": 101, \"suspect\": 102, \"response\": 103, \"process\": 104, \"post\": 105, \"fast\": 106, \"ldl\": 107, \"levels\": 108, \"cigarettes\": 109, \"cardiovascular\": 110, \"affect\": 111, \"relate\": 112, \"regular\": 113, \"physical\": 114, \"activity\": 115, \"balanced\": 116, \"nutrition\": 117, \"healthy\": 118, \"eating\": 119, \"improve\": 120, \"history\": 121, \"hereditary\": 122, \"monitoring\": 123, \"check\": 124, \"at\": 125, \"poor\": 126, \"rehab\": 127, \"common\": 128, \"water\": 129, \"fluids\": 130, \"irregular\": 131, \"heartbeat\": 132, \"rhythm\": 133, \"problems\": 134, \"definition\": 135, \"drinking\": 136, \"with\": 137, \"help\": 138, \"evening\": 139, \"hello\": 140, \"hi\": 141, \"what's\": 142, \"up\": 143, \"morning\": 144, \"afternoon\": 145, \"hey\": 146, \"stop\": 147, \"bye\": 148, \"quit\": 149, \"goodbye\": 150, \"exit\": 151, \"take\": 152, \"see\": 153, \"later\": 154, \"so\": 155, \"much\": 156, \"appreciate\": 157, \"lot\": 158, \"think\": 159, \"severe\": 160, \"ambulance\": 161}"}}